INSERT INTO countries VALUES
	(DEFAULT, 'Россия', 'UEFA'),
	(DEFAULT, 'Египет', 'CAF'),
	(DEFAULT, 'Уругвай', 'CONMEBOL'),
	(DEFAULT, 'Саудовская Аравия', 'AFC'),
	(DEFAULT, 'Аргентина', 'CONMEBOL'),
	(DEFAULT, 'Испания', 'UEFA'),
	(DEFAULT, 'Нидерланды', 'UEFA'),
	(DEFAULT, 'Сербия', 'UEFA'),
	(DEFAULT, 'Бразилия', 'CONMEBOL'),
	(DEFAULT, 'Парагвай', 'CONMEBOL'),
	(DEFAULT, 'Турция', 'UEFA'),
	(DEFAULT, 'Франция', 'UEFA'),
	(DEFAULT, 'Панама', 'CONCACAF'),
	(DEFAULT, 'Колумбия', 'CONMEBOL');

INSERT INTO basecamps VALUES
	(2, 'Санкт-Петербург', 'Санкт-Петербург'),
	(5, 'Сочи', 'Краснодарский край'),
	(7, 'Саранск', 'Республика Мордовия'),
	(9, 'Химки', 'Московская область'),
	(10, 'Светлогорск', 'Калининградская область'),
	(12, 'Бор', 'Нижегородская область'),
	(13, 'Истра', 'Московская область'),
	(20, 'Краснодар', 'Краснодарский край'),
	(22, 'Бронницы', 'Московская область'),
	(24, 'Грозный', 'Чеченская республика');

INSERT INTO teams VALUES
	(1, 1, 'A', 9, 2018, 1),
	(2, 2, 'A', 24, 2018, 0),
	(3, 3, 'A', 12, 2018, 0),
	(4, 4, 'A', 2, 2018, 0),
	(5, 5, 'D', 22, 2018, 0),
	(6, 6, 'B', 20, 2018, 0),
	(7, 8, 'E', 10, 2018, 0),
	(8, 9, 'E', 5, 2018, 0),
	(9, 12, 'C', 13, 2018, 0),
	(10, 13, 'G', 7, 2018, 0);

INSERT INTO coaches VALUES 
	(1, 'Станислав Черчесов', 1, 1, '1963.09.02'),
	(2, 'Эктор Купер', 2, 5, '1955.11.16'),
	(3, 'Оскар Табарес', 3, 3, '1947.03.03'),
	(4, 'Хуан Антонио Пицци', 4, 6, '1968.06.07'),
	(5, 'Хорхе Сампаоли', 5, 5, '1960.03.13'),
	(6, 'Фернандо Йерро', 6, 6, '1968.03.23'),
	(7, 'Младен Крстаич', 7, 8, '1974.03.04'),
	(8, 'Аденор Леонардо Бакши', 8, 9, '1961.05.25'),
	(9, 'Дидье Дешам', 9, 12, '1968.10.15'),
	(10, 'Эрнан Дарио Гомес', 10, 14, '1956.02.03');
	
INSERT INTO referees VALUES
	(1, 'Нестор Питана', 5, '1975.07.17'),
	(2, 'Эрнан Майдана', 5, '1972.02.14'),
	(3, 'Хуан Пабло Белатти', 5, '1979.04.15'),
	(4, 'Сандро Риччи', 9, '1974.11.19'),
	(5, 'Бьерн Кёйперс', 7, '1973.03.28'),
	(6, 'Сандер ван Рукель', 7, '1974.03.28'),
	(7, 'Эрвин Зейнстра', 7, '1977.01.31'),
	(8, 'Милорад Мажич', 8, '1973.03.23');

INSERT INTO clubs VALUES
	(1, 'ЦСКА', 'Москва', 1),
	(2, 'Вильярреал', 'Вильярреаль', 6),
	(3, 'Краснодар', 'Краснодар', 1),
	(4, 'Арсенал', 'Тула', 1),
	(5, 'Леванте', 'Валенсия', 6),
	(6, 'Атлетико Мадрид', 'Мадрид', 6),
	(7, 'Васко да Гама', ' Рио-де-Жанейро', 9),
	(8, 'Бока Хуниорс', 'Буэнос-Айрес', 5),
	(9, 'Пари Сен-Жермен', 'Париж', 12),
	(10, 'Крузейро', 'Белу-Оризонти', 9);

INSERT INTO players VALUES
	(1, 'Александр Головин', 1, 17, 'MF', '1996.05.30', 1),
	(2, 'Артём Дзюба', 1, 22, 'FW', '1988.08.22', 4),
	(3, 'Денис Черышев', 1, 6, 'MF', '1990.12.26', 2),
	(4, 'Юрий Газинский', 1, 8, 'MF', '1989.07.20', 3),
	(5, 'Фахад аль-Муваллад', 4, 19, 'FW', '1994.09.14', 5),
	(6, 'Салим аль-Давсари', 4, 18, 'MF', '1991.08.19', 2),
	(7, 'Диего Годин', 3, 3, 'DF', '1986.02.16', 6),
	(8, 'Джорджиан Де Арраскаэта', 3, 10, 'MF', '1994.06.01', 10),
	(9, 'Эдинсон Кавани', 3, 21, 'FW', '1987.02.14', 9),
	(10, 'Найтан Нандес', 3, 8, 'MF', '1995.12.28', 8);

INSERT INTO game_places VALUES 
	(1, 'Москва', 'Лужники'),
	(2, 'Калининград', 'Калининград'),
	(3, 'Санкт-Петербург', 'Санкт-Петербург'),
	(4, 'Нижний Новгород', 'Нижний Новгород'),
	(5, 'Волгоград', 'Волгоград Арена'),
	(6, 'Казань', 'Казань Арена'),
	(7, 'Самара', 'Самара Арена'),
	(8, 'Саранск', 'Мордовия Арена'),
	(9, 'Ростов-на-Дону', 'Ростов Арена'),
	(10, 'Сочи', 'Фишт'),
	(11, 'Екатеринбург', 'Екатеринбург Арена'),
	(12, 'Москва', 'Спартак');

INSERT INTO games VALUES 
	(1, 1, 4, '2018-06-14:18-00-00', 1, 'group'),
	(2, 2, 3, '2018-06-15:17-00-00', 11, 'group'),
	(3, 1, 2, '2018-06-19:21-00-00', 3, 'group'),
	(4, 3, 4, '2018-06-20:18-00-00', 9, 'group'),
	(5, 3, 1, '2018-06-25:18-00-00', 7, 'group'),
	(6, 4, 2, '2018-06-25:17-00-00', 5, 'group'),
	(7, 6, 1, '2018-07-01:17-00-00', 1, '1/8');

INSERT INTO player_on_game VALUES 
	(1, 1),
	(2, 1),
	(3, 1),
	(4, 1),
	(5, 1),
	(6, 1),
	(1, 5),
	(2, 5),
	(3, 5),
	(9, 5),
	(10, 5);

INSERT INTO game_events VALUES 
	(1, 4, 12, 'goal', 1),
	(1, 4, 24, 'replace', 3),
	(1, 3, 43, 'goal', 1),
	(1, 2, 71, 'goal', 1),
	(1, 3, 91, 'goal', 2),
	(1, 1, 94, 'goal', NULL);

INSERT INTO game_events VALUES 
	(2, 4, 68, 'replace', NULL);

INSERT INTO game_events VALUES 
	(2, 4, 68, 'replace', 3);

INSERT INTO game_staffs VALUES 
	(1, 1, 'main_referee'),
	(2, 1, 'assistant'),
	(3, 1, 'assistant'),
	(4, 1, 'reserve_referee'),
	(5, 2, 'main_referee'),
	(6, 2, 'assistant'),
	(7, 2, 'assistant'),
	(8, 2, 'reserve_referee');
